# Re-indexing

In [5]:
import numpy as np

In [29]:
import pandas as pd

In [10]:
from pandas import Series,DataFrame

In [4]:
a = {
  'cars': ["BMW", "Volvo", "Ford"],
  'passings': [3, 7, 2]
}

myvar = pd.DataFrame(a)

print(myvar)

    cars  passings
0    BMW         3
1  Volvo         7
2   Ford         2

In [5]:
s1=Series([1,2,3,4],index=['a','b','c','d'])

In [6]:
s1

a    1
b    2
c    3
d    4
dtype: int64

In [7]:
a=s1.reindex(['a','b','c','d','e','f'])

In [8]:
a

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
f    NaN
dtype: float64

In [9]:
#whenever NaN comes, the remaning values become float in replacing integer

In [10]:
d=s1.reindex(list('abcedf'),fill_value=1)

In [11]:
d

a    1
b    2
c    3
e    1
d    4
f    1
dtype: int64

In [12]:
c=s1.reindex(list('abcdef'),fill_value=1)

In [13]:
c

a    1
b    2
c    3
d    4
e    1
f    1
dtype: int64

In [14]:
e=c.reindex(['a','b','c','d','e','f','x','y','z'])

In [15]:
e

a    1.0
b    2.0
c    3.0
d    4.0
e    1.0
f    1.0
x    NaN
y    NaN
z    NaN
dtype: float64

In [16]:
f=c.reindex(list('abcdefxyz'),fill_value=15)

In [17]:
f                                                  #...................1

a     1
b     2
c     3
d     4
e     1
f     1
x    15
y    15
z    15
dtype: int64

In [18]:
g=c.reindex(list('abcdefxyz'),fill_value=15)

In [19]:
g                                                 #....................2

a     1
b     2
c     3
d     4
e     1
f     1
x    15
y    15
z    15
dtype: int64

In [20]:
s2=Series(['India','UK','US'],index=[0,5,10])

In [21]:
s2

0     India
5        UK
10       US
dtype: object

In [22]:
h=s2.reindex(range(15),method='ffill')     #ffill=forwardfill

In [23]:
h

0     India
1     India
2     India
3     India
4     India
5        UK
6        UK
7        UK
8        UK
9        UK
10       US
11       US
12       US
13       US
14       US
dtype: object

In [24]:
i=s2.reindex(range(15),method='bfill')     #bfill=backwardfill

In [25]:
i

0     India
1        UK
2        UK
3        UK
4        UK
5        UK
6        US
7        US
8        US
9        US
10       US
11      NaN
12      NaN
13      NaN
14      NaN
dtype: object

In [33]:
x=DataFrame(np.arange(25).reshape(5,5),index=list('abcde'),columns=['c1','c2','c3','c4','c5'])

In [34]:
x

   c1  c2  c3  c4  c5
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

In [38]:
y=x.reindex(['a','b','c','d','e','f'])

In [39]:
y

     c1    c2    c3    c4    c5
a   0.0   1.0   2.0   3.0   4.0
b   5.0   6.0   7.0   8.0   9.0
c  10.0  11.0  12.0  13.0  14.0
d  15.0  16.0  17.0  18.0  19.0
e  20.0  21.0  22.0  23.0  24.0
f   NaN   NaN   NaN   NaN   NaN

In [40]:
z=x.reindex(list('abcedf'),fill_value=1)

In [41]:
z

   c1  c2  c3  c4  c5
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
e  20  21  22  23  24
d  15  16  17  18  19
f   1   1   1   1   1

In [44]:
j=y.reindex(columns=['c1','c2','c3','c4','c5','c6'])

In [45]:
j

     c1    c2    c3    c4    c5  c6
a   0.0   1.0   2.0   3.0   4.0 NaN
b   5.0   6.0   7.0   8.0   9.0 NaN
c  10.0  11.0  12.0  13.0  14.0 NaN
d  15.0  16.0  17.0  18.0  19.0 NaN
e  20.0  21.0  22.0  23.0  24.0 NaN
f   NaN   NaN   NaN   NaN   NaN NaN

# Drop Function

In [48]:
k=j.drop('c')

In [49]:
k

     c1    c2    c3    c4    c5  c6
a   0.0   1.0   2.0   3.0   4.0 NaN
b   5.0   6.0   7.0   8.0   9.0 NaN
d  15.0  16.0  17.0  18.0  19.0 NaN
e  20.0  21.0  22.0  23.0  24.0 NaN
f   NaN   NaN   NaN   NaN   NaN NaN

In [53]:
l=j.drop('c6',axis=1)                           #.................axis by default takes columns

In [54]:
l

     c1    c2    c3    c4    c5
a   0.0   1.0   2.0   3.0   4.0
b   5.0   6.0   7.0   8.0   9.0
c  10.0  11.0  12.0  13.0  14.0
d  15.0  16.0  17.0  18.0  19.0
e  20.0  21.0  22.0  23.0  24.0
f   NaN   NaN   NaN   NaN   NaN

In [62]:
m=l.drop(['c1','c5'],axis=1)                           #.................axis by default takes columns

In [63]:
m

     c2    c3    c4
a   1.0   2.0   3.0
b   6.0   7.0   8.0
c  11.0  12.0  13.0
d  16.0  17.0  18.0
e  21.0  22.0  23.0
f   NaN   NaN   NaN

In [64]:
x

   c1  c2  c3  c4  c5
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19
e  20  21  22  23  24

# Rank and Sort

In [67]:
s2=Series([1,2,3],index=['c','a','b'])

In [68]:
s2

c    1
a    2
b    3
dtype: int64

In [71]:
a1=s2.sort_index()

a1

In [72]:
a1

a    2
b    3
c    1
dtype: int64

In [75]:
a2=a1.sort_values()

In [76]:
a2

c    1
a    2
b    3
dtype: int64

# Random Series

In [6]:
from numpy.random import randn

In [7]:
a=np.random.randn(10)

In [8]:
a

array([ 1.38136743, -0.44687454, -0.59502254,  0.43114424,  0.50097376,
        1.13429961,  0.66187068,  0.47205426,  0.51955318,  1.056397  ])

In [11]:
b=Series(a)

In [12]:
b

0    1.381367
1   -0.446875
2   -0.595023
3    0.431144
4    0.500974
5    1.134300
6    0.661871
7    0.472054
8    0.519553
9    1.056397
dtype: float64

In [13]:
c=b.rank()

In [14]:
c

0    10.0
1     2.0
2     1.0
3     3.0
4     5.0
5     9.0
6     7.0
7     4.0
8     6.0
9     8.0
dtype: float64

In [15]:
x=Series(c)

In [16]:
x

0    10.0
1     2.0
2     1.0
3     3.0
4     5.0
5     9.0
6     7.0
7     4.0
8     6.0
9     8.0
dtype: float64

In [18]:
y=x.rank()

In [19]:
y

0    10.0
1     2.0
2     1.0
3     3.0
4     5.0
5     9.0
6     7.0
7     4.0
8     6.0
9     8.0
dtype: float64

In [20]:
x.sort_values()

2     1.0
1     2.0
3     3.0
7     4.0
4     5.0
8     6.0
6     7.0
9     8.0
5     9.0
0    10.0
dtype: float64

In [21]:
y.sort_values

<bound method Series.sort_values of 0    10.0
1     2.0
2     1.0
3     3.0
4     5.0
5     9.0
6     7.0
7     4.0
8     6.0
9     8.0
dtype: float64>

In [25]:
dframe=DataFrame(np.arange(64).reshape(8,8),index=[0,1,2,3,4,5,6,7],columns=['c1','c2','c3','c4','c5','c6','c7','c8'])

In [26]:
dframe

   c1  c2  c3  c4  c5  c6  c7  c8
0   0   1   2   3   4   5   6   7
1   8   9  10  11  12  13  14  15
2  16  17  18  19  20  21  22  23
3  24  25  26  27  28  29  30  31
4  32  33  34  35  36  37  38  39
5  40  41  42  43  44  45  46  47
6  48  49  50  51  52  53  54  55
7  56  57  58  59  60  61  62  63

In [28]:
g=np.random.randn(8)

In [29]:
g

array([ 1.34571133, -0.71007385, -0.27252264,  0.96037068, -0.6105872 ,
       -0.02989644, -1.2607106 , -0.58850282])

In [30]:
h=Series(g)

In [31]:
h

0    1.345711
1   -0.710074
2   -0.272523
3    0.960371
4   -0.610587
5   -0.029896
6   -1.260711
7   -0.588503
dtype: float64

In [44]:
DataFrame (dframe,columns=['c1','c2','c3','c4','c5','c6','c7','c8','h'])

   c1  c2  c3  c4  c5  c6  c7  c8         h
0   0   1   2   3   4   5   6   7  1.345711
1   8   9  10  11  12  13  14  15 -0.710074
2  16  17  18  19  20  21  22  23 -0.272523
3  24  25  26  27  28  29  30  31  0.960371
4  32  33  34  35  36  37  38  39 -0.610587
5  40  41  42  43  44  45  46  47 -0.029896
6  48  49  50  51  52  53  54  55 -1.260711
7  56  57  58  59  60  61  62  63 -0.588503

In [45]:
dframe['h']=g

In [46]:
dframe

   c1  c2  c3  c4  c5  c6  c7  c8         h
0   0   1   2   3   4   5   6   7  1.345711
1   8   9  10  11  12  13  14  15 -0.710074
2  16  17  18  19  20  21  22  23 -0.272523
3  24  25  26  27  28  29  30  31  0.960371
4  32  33  34  35  36  37  38  39 -0.610587
5  40  41  42  43  44  45  46  47 -0.029896
6  48  49  50  51  52  53  54  55 -1.260711
7  56  57  58  59  60  61  62  63 -0.588503